---
kind: method
id: M:Autodesk.Revit.DB.FaceArray.Insert(Autodesk.Revit.DB.Face,System.Int32)
source: html/27740dc3-d239-0cbf-1f16-3f097d7ace86.htm
---
# Autodesk.Revit.DB.FaceArray.Insert Method

Insert the specified face into the array.

## Syntax (C#)
```csharp
public virtual void Insert(
	Face item,
	int index
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Face`) - The face to be inserted into the array.
- **index** (`System.Int32`) - The face will be inserted before this index.

## Returns
Returns whether the face was inserted into the array.